# GetLinetypeTableIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..GetLinetypeTableIterator Method
ExportLinetypeTable Class See Also
---
Returns a ExportLinetypeTableIterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportLinetypeTableIterator GetLinetypeTableIterator()
```

Visual Basic
---
```text
Public Function GetLinetypeTableIterator As ExportLinetypeTableIterator
```

Visual C++
---
```text
public:
ExportLinetypeTableIterator^ GetLinetypeTableIterator()
```

# ### Return Value
A ExportLinetypeTableIterator object that can be used to iterate through key-value pairs in the collection.
# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace